#!/usr/bin/env python
# -*- coding: utf-8 -*-
import os
W = "\033[1;37m"
R = "\033[1;31m"
G = "\033[1;32m"
Y = "\033[1;33m"
#################################
def YT_GAMER_X():
	print (G + "╭━━━━━━━━━━━━━━━━━━━━━━━━━━╮")
	os.system("sleep 0.10")
	print (G + "┃" + R + "────────────" + Y + "╔═╗" + R + "───────────" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + R + "────────────" + Y + "║╔╝" + R + "───────────" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "╔══╗╔═╗╔══╗╔╝╚╗╔╗╔╗╔╗" + Y + "──" + Y + "══╗" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "║╔╗║║╔╝║║═╣╚╗╔╝╠╣╚╬╬╝" + R + "────" + Y + "║" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "║╚╝║║║" + R + "─" + Y + "║║═╣" + R + "─" + Y + "║║" + R + "─" + Y + "║║╔╬╬╗" + R + "────" + Y + "║" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "║╔═╝╚╝" + R + "─" + Y + "╚══╝" + R + "─" + Y + "╚╝" + R + "─" + Y + "╚╝╚╝╚╝" + R + "────" + Y + "║" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "║║" + R + "────" + Y + "『" + G + "𝙿𝚁𝙴𝙵𝙸𝚇" + Y + "๛" + G + "𝙰𝙳𝙳𝙴𝚁" + Y + "』" + R + "───" + Y + "║" + G + "┃")
	os.system("sleep 0.10")
	print (G + "┃" + Y + "╚╝" + R + "─" + G + "𝚃𝙾𝙾𝙻 𝙱𝚈" + Y + "『" + G + "𝚈𝚃" + Y + "๛" + G + "𝙶𝙰𝙼𝙴𝚁" + Y + "๛" + G + "𝚇" + Y + "』" + Y + "─" + Y + "╝" + G + "┃")
	os.system("sleep 0.10")
	print (G + "╰━━━━━━━━━━━━━━━━━━━━━━━━━━╯")
	os.system("sleep 0.10")
	print ("")
	os.system("sleep 0.10")
	print (Y + "【" + G + "1" + Y + "】『" + G + "𝙰𝙳𝙳" + Y + "๛" + G + "𝙿𝚁𝙴𝙵𝙸𝚇" + Y + "』")
	os.system("sleep 0.10")
	print (Y + "【" + G + "2" + Y + "】『" + G + "𝙾𝙿𝙴𝙽" + Y + "๛" + G + "𝙶𝙸𝚃" + Y + "๛" + G + "𝙷𝚄𝙱" + Y + "』")
	os.system("sleep 0.10")
	print (Y + "【" + G + "3" + Y + "】『" + G + "𝙾𝙿𝙴𝙽" + Y + "๛" + G + "𝚈𝙾𝚄" + Y + "๛" + G + "𝚃𝚄𝙱𝙴" + Y + "』")
	os.system("sleep 0.10")
	print (Y + "【" + G + "4" + Y + "】『" + G + "𝙲𝙻𝙴𝙰𝚁" + Y + "๛" + G + "𝚃𝙴𝚁𝙼𝙸𝙽𝙰𝙻" + Y + "』")
	os.system("sleep 0.10")
	print (Y + "【" + G + "5" + Y + "】『" + G + "𝙴𝚇𝙸𝚃" + Y + "』")
	os.system("sleep 0.10")
	print ("")
	os.system("sleep 0.10")
#################################
def GIT_HUB():
	os.system("xdg-open https://github.com/YT-GAMER-X")
	print (G + "\n【" + Y + "𝙾𝙿𝙴𝙽𝙸𝙽𝙶 𝙶𝙸𝚃 𝙷𝚄𝙱" + G + "】\n\n")
	os.system("sleep 2")
	YT_GAMER_X()
	input_user()
#################################
def YOU_TUBE():
	os.system("xdg-open https://youtube.com/channel/UCtKNEQ-tZiyJn73saSnNmlw")
	print (G + "\n【" + Y + "𝙾𝙿𝙴𝙽𝙸𝙽𝙶 𝚈𝙾𝚄 𝚃𝚄𝙱𝙴" + G + "】\n\n")
	os.system("sleep 2")
	YT_GAMER_X()
	input_user()
#################################
def PREFIX():
	INPUT_FILE=input(Y + "\n『" + G + "𝙸𝙽𝙿𝚄𝚃" + Y + "๛" + G + "𝙵𝙸𝙻𝙴" + Y + "๛" + G + "𝙿𝙰𝚃𝙷" + Y + "』" + G + "==" + Y + "> " + G)
	OUTPUT_FILE=input(Y + "『" + G + "𝙾𝚄𝚃𝙿𝚄𝚃" + Y + "๛" + G + "𝙵𝙸𝙻𝙴" + Y + "๛" + G + "𝙿𝙰𝚃𝙷" + Y + "』" + G + "==" + Y + "> " + G)
	PREFIX=input(Y + "『" + G + "𝙴𝚗𝚝𝚎𝚛" + Y + "๛" + G + "𝚙𝚛𝚎𝚏𝚒𝚡" + Y + "๛" + G + "𝚝𝚎𝚡𝚝" + Y + "』" + G + "==" + Y + "> " + G)
	with open(INPUT_FILE,'r') as f:
		with open(OUTPUT_FILE,'w') as f1:
			for LINE in f:
				f1.write(PREFIX+LINE)
#################################
def PREFIX_ADDER():
	PREFIX()
	print (G + "【" + Y + "✔" + G + "】𝙳𝚘𝚗𝚎. . . ")
	YT_GAMER_X()
	input_user()
#################################
def TERMINAL_CLEANER():
	os.system("clear")
	YT_GAMER_X()
	input_user()
#################################
def EXIT():
	exit()
	print ("\n" + R + "【" + G + "✔" + R + "】" + "𝙱𝚈𝙴𝙴 ...")
#################################
def input_user():
    user = input(Y + "『" + G + "𝚂𝙴𝙻𝙴𝙲𝚃" + Y + "๛" + G + "𝙽𝚄𝙼𝙱𝙴𝚁" + Y + "』" + G + "==" + Y + "> " + G)
    if user == "1":
        PREFIX_ADDER()
    elif user == "2":
    	GIT_HUB()
    elif user == "3":
    	YOU_TUBE()
    elif user == "4":
    	TERMINAL_CLEANER()
    elif user == "5":
    	EXIT()
    else:
        print ("\n" + R + "[" + G + "!" + R + "]" + "『𝚆𝚛𝚘𝚗𝚐๛𝚒𝚗𝚙𝚞𝚝』")
        YT_GAMER_X()
        input_user()
#################################
YT_GAMER_X()
input_user()
